## High level language คือ
ภาษาที่ใช้ในการเขียนโปรแกรมที่ผู้เขียนไม่จำเป็นต้องรู้ถึงโครงสร้างภายในของเครื่องแต่อย่างใด ภาษาระดับสูงมีอยู่ด้วยกันหลายภาษา เช่น ภาษาซี(C) ภาษาเบสิก(BASIC) และภาษาปาสกาล(PASCAL)เป็นต้น 
ตรงข้ามกับภาษาแอสเซมบลี (Assembly) ซึ่งเรียกกันว่าเป็นภาษาระดับต่ำ ผู้เขียนจะต้องรู้มีความรู้พื้นฐานเกี่ยวกับการทำงานของเครื่องคอมพิวเตอร์ เสียก่อน จึงจะเขียนโปรแกรมเป็นภาษานั้นได้ 
อย่างไรก็ตาม คอมพิวเตอร์จะยังไม่สามารถเข้าใจภาษาระดับสูงนี้ได้ แต่จะต้องใช้ตัวแปล (compiler) จัดการแปลเสียก่อน จึงจะปฏิบัติตามคำสั่งได้ ดู computer language ประกอบ

## Low level language คือ
เป็นภาษาคอมพิวเตอร์ที่มีลักษณะใกล้เคียงกับภาษาเครื่อง (machine language) ฉะนั้น คอมพิว เตอร์จะแปลได้ง่ายกว่าภาษาระดับสูงอย่างภาษา FORTRAN, COBOL หรือ C 
แต่ผู้เขียนโปรแกรมด้วยภาษาระดับนี้ จะพบว่าเขียนยากกว่าใช้ภาษาระดับสูง ซึ่งมีลักษณะเหมือนภาษามนุษย์มากกว่า ตัวอย่างของภาษานี้มี ภาษาแอสเซมบลี (Assembly) อยู่เพียงภาษาเดียว 
ดู high level language เปรียบเทียบ

## Machine language คือ
ภาษาคอมพิวเตอร์ที่สามารถทำให้เครื่องรับรู้และเข้าใจได้ เขียนโดยใช้รหัสเลขฐานสองเป็นหลัก (ฉะนั้น จะมีแต่เลข 0 กับ 1 เท่านั้น) คำสั่งแต่ละคำสั่งจะหมายถึงการทำงานอย่างหนึ่ง 
แต่ละโปรแกรมจึงจะยาวค่อนข้างมาก ผู้ที่เริ่มต้นเรียนคอมพิวเตอร์ใหม่ ๆ ไม่ควรเรียนการเขียนโปรแกรมด้วยภาษานี้เลย เพราะอาจจะทำให้หมดกำลังใจไปเลย อาจจะพอเปรียบได้ว่า 
เลขฐานสองนั้นก็เหมือน ๆ กับตัวโน้ต เพลง (ภาษาดนตรีก็เข้าใจยากไม่ยิ่งหย่อนไปกว่าภาษาเครื่องนี้สักเท่าใดดอก) อย่างไรก็ตาม ก็ต้องทำความเข้าใจไว้เสมอว่า 
ไม่ว่าเราจะสั่งให้เครื่องทำงานด้วยโปรแกรมภาษาอะไรก็ตาม ตัวแปลโปรแกรม (compiler) ก็จะต้องทำหน้าที่แปลภาษาที่เราใช้ให้เป็นภาษาเครื่องก่อนเสมอ 
คอมพิวเตอร์จึงจะเข้าใจจนสามารถปฏิบัติตามคำสั่ง (execute) นั้น ๆ ได้

## โปรเซสเซอร์(Processor)
คือ หน่วยประมวลผลกลาง (Central Processing Unit) หรือ CPU (ซีพียู) หรือ โปรเซสเซอร์ (Processor) เป็นองค์ประกอบที่สำคัญส่วนหนึ่งของเครื่องคอมพิวเตอร์ทุกประเภทในโลก 
เปรียบเสมือนกับเป็นมันสมองให้กับคอมพิวเตอร์นั่นเอง ประกอบไปด้วยวงจรทางไฟฟ้ามากมาย ที่อยู่บนแผ่นซิลิกอนซิป  ซึ่งมีขนาดเล็กมาก ๆ
