## จากชื่อ Loedphob Suphason จะใช้อักษตร L,S
ซึ่งตรงกับ ascii rable = 4c , 53

คำสั่งที่1 : นำaddi x1,x0,32  แถวทั้งหมดเรียก1เวิด นำ1เวิดทั้งหมดนี้มาเรียงค่าใหม่
        คือการนำ32บวกกับx0 ได้ผลลัพธ์ออกมานำไปเก็บที่x1
        
คำสั่งที่2 : lux x2,0xc0000000 นำค่าผลลัพธ์ไปเก็บที่x3  

คำสั่งที่3 : lbu x3, 0(x1) จะโหลดไบท์จาก x1 ซึ่งx1 จะเรียกตำแหน่ง 00000020 คือ 4c มีค่าเป็นตัว L ไปเก็บไว้ที่x3

คำสั่งที่4 : beq x3, x0, +16 กระโดดไปข้างหน้า16หรือถัดไป4ตำแหน่ง

คำสั่งที่5 : sb x3, 0(x2) นำข้อมูลใน X3 ไปเก็บที่ X2

คำสั่งที่6 : jal x0, -16 นำ 1+X1 และนำคำตอบที่ได้เก็บที่ X1 

คำสั่งที่7 : jal x0, 0 มันจะกระโดดวนอยู่ที่เดิม
